"""
Определите количество четырехзначных чисел, записанных в десятичной системе 
счисления, в записи которых есть ровно две одинаковые цифры, причем стоящие рядом.
"""

cnt = 0
for A in map(str, range(1000, 10000)):
    if A[0] != A[1] and A[1] != A[2] and A[2] != A[3]:
        continue
    if A[0] == A[1] == A[2] or A[1] == A[2] == A[3]:
        continue
    for d in "0123456789":
        if A.count(d) > 2:
            break
    else:
        cnt += 1
print(cnt)